app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def new
    @category = Category.new
    @categories = Category.all.order(:name)

SELECT "categories".* FROM "categories" WHERE (id != 1) ORDER BY "categories"."name" ASC
---
  def edit
  @categories = Category.where("id != #{@category.id}").order(:name)

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "HTML!"], ["updated_at", "2018-02-05 13:01:56.610399"], ["id", 5]]
---
  def update
    if @category.update_attributes(category_params)