app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at", "image", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
   def create
     @post = Post.new(post_params)
     if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
   def update

     if @post.update_attributes(post_params)