app/controllers/categories_controller.rb

  def show
    @posts = Post.where(category_id: [@category.subtree_ids]).paginate(page: params[:page], per_page: 3)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" IN (3, 4, 5) LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" IN (1, 2, 6)