app/controllers/posts_controller.rb

   def index
      @posts = Post.paginate(page: params[:page], per_page: 3)
---
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"