app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "ruby"], ["LIMIT", 1]]
---
	def show
		@tag = Tag.find_by(name: params[:id])